[
    {
        "cluster_id": 10274284,
        "absolute_url": "/opinion/10274284/state-of-tennessee-v-alexis-faxon/",
        "caseName": "State of Tennessee v. Alexis Faxon",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-11-14",
        "judge": "Jill Bartee Ayers",
        "syllabus": "Defendant, Alexis Faxon, was convicted by a Sullivan County jury of reckless driving andspeeding which resulted in a fatal two-car accident. The trial court sentenced Defendantto consecutive sentences of thirty days' incarceration for speeding and six monthssuspended to probation for reckless driving. Defendant appeals, arguing that the evidenceis insufficient to support her conviction for reckless driving, that the trial court erred bydenying a mistrial based on alleged discovery violations, and that the trial court erred byadmitting photographs and victim impact statements at the sentencing hearing and byordering thirty days' incarceration. Upon our review of the entire record, the briefs of theparties, and the applicable law, we affirm the judgments of the trial court."
    },
    {
        "cluster_id": 10659992,
        "absolute_url": "/opinion/10659992/state-v-wilson/",
        "caseName": "State v. Wilson",
        "court": "Ohio Court of Appeals",
        "dateFiled": "2025-08-25",
        "judge": "Hensal",
        "syllabus": "reckless driving, duty to obtain evidence, manifest weight, R.C. 4511.20, R.C. 4511.39"
    },
    {
        "cluster_id": 4856271,
        "absolute_url": "/opinion/4856271/state-of-tennessee-v-frederick-john-schmitz-jr/",
        "caseName": "STATE OF TENNESSEE v. FREDERICK JOHN SCHMITZ, JR.",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2021-02-12",
        "judge": "Robert W. Wedemeyer",
        "syllabus": "A Hickman County jury convicted the Defendant, Frederick John Schmitz, Jr., of evading arrest while operating a motor vehicle, reckless driving, and speeding. The trial court sentenced him to an effective eighteen-month sentence, suspended to supervised probation. On appeal, the Defendant contends that the evidence at trial was insufficient to support his convictions for evading arrest and reckless driving. After a thorough review of the record and the applicable law, we affirm the trial court's judgments."
    },
    {
        "cluster_id": 6448794,
        "absolute_url": "/opinion/6448794/state-of-tennessee-v-sterling-white/",
        "caseName": "State of Tennessee v. Sterling White",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2022-03-07",
        "judge": "Robert H. Montgomer, Jr.",
        "syllabus": "The Defendant, Sterling White was convicted by a Knox County Criminal Court jury of evading arrest, a Class E felony reckless driving, a Class B misdemeanor and leaving the scene of an accident, a Class B misdemeanor. See T.C.A. §§ 39-16-603 (2018) (subsequently amended) (evading arrest), 55-10-205 (2020) (reckless driving), 55-10-102 (Supp. 2017) (subsequently amended) (leaving the scene). The trial court sentenced the Defendant as a persistent offender to six years' confinement. On appeal, the Defendant contends that (1) the evidence is insufficient to support his convictions and (2) the trial court erred by denying his motion for a continuance. We affirm the judgments of the trial court."
    },
    {
        "cluster_id": 10583350,
        "absolute_url": "/opinion/10583350/state-v-rochon/",
        "caseName": "State v. Rochon",
        "court": "Ohio Court of Appeals",
        "dateFiled": "2025-05-13",
        "judge": "Mayle",
        "syllabus": "Trial court's decision to deny limited driving privileges under R.C. 4510.021 was not an abuse of discretion following defendant's conviction for reckless driving and speeding. Defendant was cited for driving 110 mph, into on-coming lane of traffic and in a residential area."
    },
    {
        "cluster_id": 4674252,
        "absolute_url": "/opinion/4674252/interest-of-kv/",
        "caseName": "Interest of K.V.",
        "court": "North Dakota Supreme Court",
        "dateFiled": "2019-10-29",
        "judge": "Crothers, Daniel John",
        "syllabus": "Juvenile court findings of delinquency for fleeing or attempting to elude a peace officer and reckless driving are not clearly erroneous and are affirmed. A juvenile court finding of delinquency for criminal trespass is reversed due to insufficient evidence."
    },
    {
        "cluster_id": 4901557,
        "absolute_url": "/opinion/4901557/state-of-tennessee-v-cindy-b-hinton/",
        "caseName": "State of Tennessee v. Cindy B. Hinton",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2021-07-21",
        "judge": "D. Kelly Thomas, Jr.",
        "syllabus": "The Defendant, Cindy B. Hinton, appeals her convictions for vehicular homicide by intoxication and vehicular homicide by reckless driving. The Defendant argues that the evidence was insufficient relative to the Defendant's intoxication and that the court erred by imposing a sentence of eleven years in confinement. After a thorough review of the record and applicable law, we affirm."
    },
    {
        "cluster_id": 10284278,
        "absolute_url": "/opinion/10284278/state-of-tennessee-v-desmond-lanier-hatchett/",
        "caseName": "State of Tennessee v. Desmond Lanier Hatchett",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-11-26",
        "judge": "Jill Bartee Ayers",
        "syllabus": "Defendant, Desmond Lanier Hatchett, was convicted by a Knox County jury of evadingarrest with risk of death or injury, driving while his license was revoked, reckless driving,violation of the financial responsibility law, and violation of the window tint law. The trialcourt imposed an effective sentence of six years' incarceration. Defendant appeals, arguingthat the trial court erred in imposing a six-year sentence for evading arrest with risk ofdeath or injury. Upon review of the entire record, briefs and oral arguments of the parties,and the applicable law, we affirm the judgment of the trial court."
    },
    {
        "cluster_id": 10010789,
        "absolute_url": "/opinion/10010789/state-of-tennessee-v-richard-caldwell/",
        "caseName": "State of Tennessee v. Richard Caldwell",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-07-22",
        "judge": "Robert L. Holloway, Jr.",
        "syllabus": "Following a trial, a jury found Defendant, Richard Caldwell, guilty of felony evading arrest, reckless driving, and driving on a revoked or suspended license, for which Defendant received an effective two-year sentence. On appeal, Defendant contends that the trial court erred in denying his request for a jury instruction regarding the State's duty to preserve evidence. After a thorough review of the record and applicable case law, we affirm the judgments of the trial court."
    },
    {
        "cluster_id": 4680122,
        "absolute_url": "/opinion/4680122/interest-of-kv/",
        "caseName": "Interest of K.V.",
        "court": "North Dakota Supreme Court",
        "dateFiled": "2019-10-29",
        "judge": "Crothers, Daniel John",
        "syllabus": "Juvenile court findings of delinquency for fleeing or attempting to elude a peace officer and reckless driving are not clearly erroneous and are affirmed. A juvenile court finding of delinquency for criminal trespass is reversed due to insufficient evidence."
    },
    {
        "absolute_url": "/opinion/10616858/state-of-tennessee-v-demarqushon-marquis-hinton/",
        "caseName": "State of Tennessee v. Demarqushon Marquis Hinton",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2025-06-25",
        "judge": "Matthew J. Wilson",
        "syllabus": "A Madison County jury convicted Defendant, Demarqushon Marquis Hinton, of evading arrest in a motor vehicle with risk of death or injury, two counts of attempted second degree murder, two counts of employing a firearm during the commission of or attempt to commit a dangerous felony, theft of a firearm valued at less than $2,500, reckless driving, failure to obey a traffic control device, and failure to stop at a stop sign. The trial court imposed an effective sentence of twenty-four years to be served in confinement. On appeal, Defendant challenges the sufficiency of the evidence supporting his attempted second degree murder and firearm convictions, and he argues that his sentence is excessive. Upon review, we affirm the trial court's judgments."
    },
    {
        "absolute_url": "/opinion/10289516/state-of-tennessee-v-joey-dewayne-callahan/",
        "caseName": "State of Tennessee v. Joey Dewayne Callahan",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-12-06",
        "judge": "Robert L. Holloway, Jr.",
        "syllabus": "Joey Dewayne Callahan (\"Defendant\") appeals from his Marshall County Circuit Court convictions for possession with intent to sell or deliver more than 0.5 grams of methamphetamine, possession of a prohibited weapon, possession with the intent to use drug paraphernalia, resisting arrest, and reckless driving, for which he received a total effective sentence of fifteen years' incarceration. Defendant contends that the evidence was insufficient to establish his intent to sell the methamphetamine. Following a thorough review, we affirm the judgments of the trial court."
    },
    {
        "absolute_url": "/opinion/10003778/state-of-tennessee-v-brandon-l-holliday/",
        "caseName": "State of Tennessee v. Brandon L. Holliday",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-07-15",
        "judge": "Presiding  Camille R. McMullen",
        "syllabus": "A Madison County jury convicted the Appellant, Brandon L. Holliday, on multiple counts for evading arrest in a vehicle with risk of death or injury to innocent bystanders, disobeying a traffic signal, violating financial responsibility law, reckless driving, violation of duty upon striking a fixture upon a highway, and driving with a revoked license, for which he received an effective sentence of twelve years' confinement. On appeal, the Appellant argues that the evidence was insufficient to support his conviction of evading arrest because it did not establish that bystanders were at risk of death or injury during his flight. Upon review, we affirm."
    },
    {
        "absolute_url": "/opinion/4483602/state-of-tennessee-v-lee-alan-sprague/",
        "caseName": "State of Tennessee v. Lee Alan Sprague",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2018-04-03",
        "judge": "James Curwood Witt, Jr.",
        "syllabus": "The defendant, Lee Alan Sprague, appeals his Roane County Criminal Court jury convictions of reckless driving and driving on a suspended license, claiming that the trial court erred by denying his motion for a new preliminary hearing. Discerning no error, we affirm."
    },
    {
        "absolute_url": "/opinion/10386928/state-of-tennessee-v-kerrington-jkobe-lake/",
        "caseName": "State of Tennessee v. Kerrington J'Kobe Lake",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2025-04-28",
        "judge": "Presiding  Camille R. McMullen",
        "syllabus": "The Defendant, Kerrington J'Kobe Lake, entered guilty pleas to two felonies, felony evading arrest and attempted tampering with evidence; and three misdemeanors, speeding, reckless driving, and simple possession of marijuana, with the trial court to determine whether to grant judicial diversion or, alternatively, the length and manner of his sentence. Following a sentencing hearing, the trial court denied the Defendant's request for judicial diversion and imposed an effective sentence of three years, with the Defendant to serve 180 days in jail before serving the remainder of his sentence on supervised probation. On appeal, the Defendant argues the trial court (1) unreasonably denied judicial diversion, and (2) imposed an excessive sentence. After review, we affirm the trial court's judgments."
    },
    {
        "absolute_url": "/opinion/10126054/state-of-tennessee-v-johnny-ray-deyton/",
        "caseName": "State of Tennessee v. Johnny Ray Deyton",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2024-09-27",
        "judge": "Camille R. McMullen",
        "syllabus": "The Defendant, Johnny Ray Deyton, appeals his Johnson County Criminal Courtconvictions of possession of twenty-six (26) grams or more of methamphetamine withintent to sell or deliver, felony tampering with evidence, and various other misdemeanordrug and driving related offenses, for which he received an effective sentence of thirteenyears' imprisonment. Before trial, the Defendant filed a motion to suppress all evidencederived from the traffic stop which led to his arrest and indictment, arguing that the stopwas an unreasonable warrantless seizure of his person in violation of the FourthAmendment to the United States Constitution and Article 1, Section 7 of the TennesseeConstitution. Following a hearing, the trial court denied the Defendant's motion anddetermined that the traffic stop was supported by reasonable suspicion of reckless driving.The sole issue presented on appeal is whether the trial court erred in denying his motion tosuppress because the traffic stop was not supported by reasonable suspicion. After review,we affirm the trial court's judgment."
    },
    {
        "absolute_url": "/opinion/6445707/metropolitan-government-of-nashville-and-davidson-county-tennessee-v/",
        "caseName": "Metropolitan Government of Nashville and Davidson County, Tennessee v. Abdiqani Gelle- Dissent",
        "court": "Court of Appeals of Tennessee",
        "dateFiled": "2022-02-25",
        "judge": "John W. McClarty",
        "syllabus": "John W. McClarty, J., dissenting.The majority affirms the trial court's judgment that the defendant, Abdiqani Gelle (\"Defendant\"), violated a reckless driving city ordinance, Metropolitan Code of Law §12.68.180, by driving 65 miles per hour in a 45-mile-per-hour zone. The trial court determined that Defendant had failed to rebut the presumption created by the ordinance that he demonstrated \"a willful and wanton disregard for the safety of persons or property,\" i.e., drove recklessly. Defendant challenges the constitutionality of the ordinance. Specifically, Defendant raises the issue of whether the ordinance violates his due process rights under the Tennessee Constitution, article 1, section 8, whether the Metropolitan Government of Nashville and Davidson County (\"Metro\") has jurisdiction to administer a \"criminal-type punishment\" due to violation of its ordinance, and whether such punishment would violate Defendant's rights under the Tennessee Constitution, article 1, section 16. Metro argues that Defendant waived the issues by failing to properly raise them during the trial proceedings."
    },
    {
        "absolute_url": "/opinion/4663892/state-of-tennessee-v-roshaun-colbert/",
        "caseName": "State of Tennessee v. Roshaun Colbert",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2019-09-24",
        "judge": "Robert L. Holloway, Jr.",
        "syllabus": "On February 8, 2018, a Knox County jury convicted Roshaun Colbert, Defendant, on one count each of reckless endangerment, evading arrest, reckless driving, attempted tampering with evidence, and possession of drug paraphernalia. The trial court sentenced Defendant to a total effective sentence of twelve years. On November 14, 2018, the trial court vacated Defendant's conviction for reckless endangerment because reckless endangerment was not properly charged in the indictment as a lesser-included offense of aggravated assault. On appeal, Defendant argues that there was insufficient evidence to convict Defendant of attempted tampering with evidence and that the trial court erred in instructing the jury on flight. After a thorough review of the facts and applicable case law, we affirm."
    },
    {
        "absolute_url": "/opinion/4484456/state-of-tennessee-v-james-williams/",
        "caseName": "State of Tennessee v. James Williams",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2018-04-05",
        "judge": "D. Kelly Thomas, Jr.",
        "syllabus": "The Defendant, James Williams, was convicted by a jury of one count of driving under the influence (DUI) per se, one count of DUI, and one count of reckless driving. The trial court merged the DUI per se conviction with the DUI conviction and imposed a sentence of eleven months and twenty-nine days to be served in the county workhouse. On appeal, the Defendant contends that the trial court erred in denying his motion to suppress, which challenged \"the legality of the traffic stop\" resulting in the Defendant's arrest. Following our review, the judgments of the trial court are affirmed."
    },
    {
        "absolute_url": "/opinion/4618255/state-of-tennessee-v-jared-worthington/",
        "caseName": "State of Tennessee v. Jared Worthington",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2019-05-08",
        "judge": "Alan E. Glenn",
        "syllabus": "The Defendant, Jared Worthington, was convicted by a Shelby County Criminal Court jury of DUI per se, a Class A misdemeanor, and reckless driving, a Class B misdemeanor, after the State dismissed his DUI by impairment charge. He was sentenced by the trial court to concurrent terms of one day for the reckless driving conviction and 11 months, 29 days for the DUI conviction, suspended to probation after service of ten days in the county jail. On appeal, the Defendant raises the following issues: (1) Whether the trial court erred in its rulings regarding the admission and publication of the dashboard camera video of the Defendant's arrest (2) Whether the trial court violated the Tennessee constitution by disparaging the evidence, which took the form of instructing the jury that much of the video was irrelevant (3) Whether the trial court erred by not allowing defense counsel to question officers about the potential bias created by the fact that the Tennessee Bureau of Investigation (\"TBI\") blood alcohol or drug concentration test fee (\"BADT\") was collected only in those cases in which a defendant is convicted and (4) Whether the trial court \"shifted the burden of proof,\" thereby violating the Defendant's constitutional due process rights, by asking defense counsel in the presence of the jury whether the Defendant intended to put on any proof. Following our review, we affirm the judgments of the trial court."
    },
    {
        "absolute_url": "/opinion/4770958/state-of-tennessee-v-benjamin-r-franklin/",
        "caseName": "State of Tennessee v. Benjamin R. Franklin",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2020-07-27",
        "judge": "D. Kelly Thomas, Jr.",
        "syllabus": "The Defendant, Benjamin R. Franklin, appeals his convictions for three counts of vehicular homicide by intoxication and three counts of vehicular homicide by reckless driving. The Defendant argues that (1) the trial court erred by admitting Tennessee Bureau of Investigation (TBI) blood and urine test results (2) the court erred by admitting photographs of the victims at the crash scene (3) the evidence was insufficient relative to intoxication (4) the court erred by denying the Defendant's motion for a mistrial during the State's rebuttal argument and (5) the court erred in sentencing by imposing the maximum sentence, ordering consecutive sentencing, and suspending the Defendant's driver's license for ten years. After a thorough review of the record and applicable law, we affirm."
    },
    {
        "absolute_url": "/opinion/4475203/state-of-tennessee-v-randy-timothy-jones/",
        "caseName": "State of Tennessee v. Randy Timothy Jones",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2018-03-07",
        "judge": "Robert W. Wedemeyer",
        "syllabus": "A Lawrence County jury convicted the Defendant, Randy Timothy Jones, of DUI per se, reckless driving, violation of the seatbelt law, violation of the due care law, and failure to maintain his lane, and the trial court sentenced him to eleven months and twenty-nine days of probation after he served forty-eight hours in jail. On appeal, the Defendant contends that the trial court erred when it did not exclude the blood alcohol report because the State did not adequately establish the proper chain of custody. After review, we affirm the trial court's judgments."
    },
    {
        "absolute_url": "/opinion/6445708/metropolitan-government-of-nashville-and-davidson-county-tennessee-v/",
        "caseName": "Metropolitan Government of Nashville and Davidson County, Tennessee v. Abdiqani Gelle",
        "court": "Court of Appeals of Tennessee",
        "dateFiled": "2022-02-25",
        "judge": "Chief  D. Michael Swiney",
        "syllabus": "The defendant appeals the trial court's judgment finding that he violated a reckless driving city ordinance, Metropolitan Code of Law § 12.68.180, when he drove 65 miles per hour in a 45-mile-per-hour zone. During trial, Metropolitan Government of Nashville & Davidson County, Tennessee (\"Metro\") presented evidence regarding the defendant's speed to support its allegation that the defendant was driving recklessly. Following proof of the defendant's excessive speed, the trial court found that the defendant had failed to rebut the presumption created by ordinance that he was driving in such a way as to demonstrate \"a wilful and wanton disregard for the safety of persons or property.\" The defendant challenges the constitutionality of such ordinance, which provides a rebuttable presumption that the defendant was driving recklessly when driving at least fifteen miles per hour over the speed limit. However, the defendant's issues concerning constitutionality of the ordinance were not properly raised or decided by the trial court, and upon our determination that the ordinance is not facially unconstitutional, we hold that the defendant has waived his issues regarding the constitutionality of the ordinance. Upon our review of the record, we affirm the trial court's judgment that the defendant violated Metropolitan Code of Law § 12.68.180."
    },
    {
        "absolute_url": "/opinion/4578912/state-v-joseph-silva/",
        "caseName": "State v. Joseph Silva",
        "court": "Supreme Court of Rhode Island",
        "dateFiled": "2019-01-04",
        "judge": "Suttell, Goldberg, Flaherty, Robinson, Indeglia",
        "syllabus": "The defendant, Joseph Silva, appealed his conviction for one count of reckless driving, for which he was sentenced to one year at the Adult Correctional Institutions, the entirety of which was suspended, with probation. On appeal, the defendant argued that the trial justice erred in denying his motion for a new trial. The Supreme Court accepted the trial justice's credibility determinations and affirmed the denial of the defendant's motion for a new trial. In doing so, the Court reasoned that the trial justice thoroughly described his decision to deny defendant's motion for a new trial, wherein he took into account the evidence in light of the jury charge, independently assessed the evidence, and determined that he would have reached the same conclusion as the jury. Therefore, the Court affirmed the Superior Court's judgment."
    },
    {
        "absolute_url": "/opinion/4661592/state-of-tennessee-v-johnthony-k-walker/",
        "caseName": "State of Tennessee v. Johnthony K. Walker",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2019-09-17",
        "judge": "Timothy L. Easter",
        "syllabus": "Defendant, Johnthony K. Walker, was convicted of six counts of criminally negligent homicide, eleven counts of reckless aggravated assault, seven counts of assault, one count of reckless endangerment, one count of reckless driving, and one count of the use of a portable electronic device by a school bus driver after a school bus he was driving crashed leaving six children dead and numerous other children injured. The trial court sentenced Defendant to an effective sentence of four years for the convictions and denied judicial diversion after a sentencing hearing. On appeal, Defendant argues that the trial court improperly denied judicial diversion and/or an alternative sentence. After a thorough review, we affirm the judgments of the trial court."
    },
    {
        "absolute_url": "/opinion/4518733/state-of-tennessee-v-samantha-gadzo/",
        "caseName": "State of Tennessee v. Samantha Gadzo",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2018-07-19",
        "judge": "Camille R. McMullen",
        "syllabus": "The Defendant, Samantha Gadzo, was indicted for driving under the influence of an intoxicant, driving under the influence per se, reckless driving, violation of the Due Care law, and failure to maintain her lane of travel. See T.C.A. §§ 55-10-401,-401(a)(2),-205 55-8-136, -123. She filed a motion to suppress the evidence seized during the traffic stop, arguing that it was not supported by reasonable suspicion or probable cause.1 Following a hearing, the trial court granted the Defendant's motion, which is the subject of this State appeal. Upon review, we affirm the judgment of the trial court."
    },
    {
        "absolute_url": "/opinion/4756547/state-of-tennessee-v-james-robert-black-jr/",
        "caseName": "State of Tennessee v. James Robert Black, Jr.",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2020-05-27",
        "judge": "Thomas T. Woodall",
        "syllabus": "Defendant, James Robert Black, Jr., was charged in a seven-count indictment returned by the Lawrence County Grand Jury with DUI second offense, DUI per se second offense, reckless driving, violation of the open container law, violation of the child restraint law, driving his vehicle left of the center of the road, and violation of the implied consent law. All the charges were the result of one traffic stop of Defendant by a trooper of the Tennessee Highway Patrol. Defendant filed a motion to suppress all evidence seized on the basis that the trooper made an unconstitutional stop of Defendant's vehicle without probable cause or reasonable suspicion supported by specific and articulable facts that a crime had been, or was about to be, committed. After an evidentiary hearing, the trial court granted the motion. As a result, the charges were dismissed upon motion of the State and the State filed an appeal as of right. After review, we affirm the judgment of the trial court."
    },
    {
        "absolute_url": "/opinion/4756547/state-of-tennessee-v-james-robert-black-jr/",
        "caseName": "State of Tennessee v. James Robert Black, Jr.",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2020-05-27",
        "judge": "Thomas T. Woodall",
        "syllabus": "Defendant, James Robert Black, Jr., was charged in a seven-count indictment returned by the Lawrence County Grand Jury with DUI second offense, DUI per se second offense, reckless driving, violation of the open container law, violation of the child restraint law, driving his vehicle left of the center of the road, and violation of the implied consent law. All the charges were the result of one traffic stop of Defendant by a trooper of the Tennessee Highway Patrol. Defendant filed a motion to suppress all evidence seized on the basis that the trooper made an unconstitutional stop of Defendant's vehicle without probable cause or reasonable suspicion supported by specific and articulable facts that a crime had been, or was about to be, committed. After an evidentiary hearing, the trial court granted the motion. As a result, the charges were dismissed upon motion of the State and the State filed an appeal as of right. After review, we affirm the judgment of the trial court."
    },
    {
        "absolute_url": "/opinion/5294912/state-of-tennessee-v-benjamin-barton/",
        "caseName": "State of Tennessee v. Benjamin Barton",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2021-11-04",
        "judge": "Presiding  John Everett Williams",
        "syllabus": "A jury convicted the Defendant, Benjamin Barton, of driving under the influence of an intoxicant (\"DUI\"), driving with a blood alcohol level in excess of 0.08 percent (\"DUI per se\"), and reckless driving. The trial court sentenced him to an effective sentence of eleven months and twenty-nine days, with six months to be served in confinement. The Defendant moved for a new trial and for the trial court to reconsider his sentence under Tennessee Rule of Criminal Procedure 35, and the motions were denied. On appeal, the Defendant asserts that the evidence is insufficient to sustain the verdicts, that he is entitled to a mistrial due to a discovery violation regarding expert testimony on retrograde extrapolation, that the trial court abused its discretion in failing suspend his sentence due to his health, and that there are errors on the judgment forms. We conclude that the Defendant is not entitled to relief on his convictions but that the sentencing forms are in conflict with the trial court's oral judgments, and we remand for the trial court to correct the forms."
    },
    {
        "absolute_url": "/opinion/4380135/state-v-jose-angeles/",
        "caseName": "State v. José Angeles",
        "court": "Supreme Court of Rhode Island",
        "dateFiled": "2017-04-03",
        "judge": "Flaherty, Goldberg, Indeglia, Robinson, Suttell",
        "syllabus": "When giving his instructions to the jury at the conclusion of the parties' final arguments, the trial justice referred to a suppression hearing that had occurred before trial, and he instructed the jury that the question of whether the police lawfully seized cocaine from José Angeles, the defendant, was a legal issue that he would decide. After a jury convicted the defendant of two counts of felony assault and one count each of possession of a controlled substance, resisting arrest, and reckless driving, the defendant petitioned the Supreme Court for a writ of certiorari, arguing that the trial justice's jury instructions constituted reversible error because the instructions amounted to commenting on the evidence, and were \"confusing, misleading, unnecessary and bolstering.\""
    },
    {
        "absolute_url": "/opinion/5297759/state-of-tennessee-v-casey-lynn-hopper/",
        "caseName": "State of Tennessee v. Casey Lynn Hopper",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2021-11-15",
        "judge": "D. Kelly Thomas, Jr.",
        "syllabus": "The Defendant, Casey Lynn Hopper, appeals his convictions for felony evading arrest causing a risk of death or injury, a Class D felony reckless endangerment with a motor vehicle, a Class E felony driving with a revoked license and reckless driving, Class B misdemeanors and speeding, a Class C misdemeanor, and his effective twelve-year sentence. See Tenn. Code Ann. §§ 39-13-103, -16-603(b)(3)(B), 55-8-152, -10-205, -50- 504. In this appeal as of right, the Defendant argues that (1) the trial court erred by forcing the Defendant to choose whether to accept a plea offer or proceed to trial before the State produced complete discovery materials (2) the State failed to collect or preserve favorable evidence, specifically a convenience store surveillance recording (3) the State failed to provide the defense with exculpatory evidence, specifically a pair of binoculars (4) the trial court improperly limited cross-examination by prohibiting the defense from introducing a photograph of a third party and questioning a police witness about him (5) the Defendant's convictions for felony evading arrest and reckless endangerment violate double jeopardy (6) the evidence is insufficient to support his convictions and (7) the trial court erred by imposing consecutive sentencing. After reviewing the record, we affirm the judgments of the trial court."
    },
    {
        "absolute_url": "/opinion/4666196/state-v-sow/",
        "caseName": "State v. Sow",
        "court": "Ohio Court of Appeals",
        "dateFiled": "2019-10-02",
        "judge": "Mock",
        "syllabus": "POSTCONVICTION–COUNSEL: The postconviction petition was not subject to dismissal under R.C. 2953.23 as untimely or successive: the common pleas court had jurisdiction to decide the timely filed petition on the merits, regardless of the pendency of the direct appeal the court did not lose that jurisdiction when it erroneously denied the petition for lack of jurisdiction and an appeal was proper from the subsequent entry of a final appealable order, with findings of fact and conclusions of law, denying the \"refiled\" petition on the merits. The common pleas court properly denied without an evidentiary hearing petitioner's postconviction claim that his no-contest pleas to vehicular assault and aggravated vehicular assault had been the unknowing and unintelligent product of his trial counsel's ineffectiveness in failing to secure the exclusion of blood-alcohol test results by exposing allegedly false statements contained in the search-warrant affidavit: the claim was not barred under the doctrine of res judicata, because it depended for its resolution upon evidence outside the record but petitioner failed to demonstrate substantive grounds for relief, when neither conviction depended solely on the blood-alcohol test results, and the record disclosed legally sufficient evidence of other indicia of alcohol consumption and impaired and reckless driving."
    },
    {
        "absolute_url": "/opinion/4448137/state-of-tennessee-v-melvin-brown/",
        "caseName": "State of Tennessee v. Melvin Brown",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2017-12-01",
        "judge": "Camille R. McMullen",
        "syllabus": "The Defendant, Melvin Brown, was indicted by the Shelby County Grand Jury for driving under the influence (\"DUI\") DUI with a blood alcohol concentration of .20% or more violation of the implied consent law reckless driving and driving on a revoked, suspended, or cancelled license. The trial court granted the Defendant's motion to suppress the results of his blood test on the basis that Tennessee Code Annotated section 55-10-406 was unconstitutional1 and that there were no exigent circumstances that prevented the officers from obtaining a warrant. Thereafter, the State sought and was granted permission to file an interlocutory appeal, contending that Tennessee Code Annotated section 55-10-406 was constitutional, that exigent circumstances justified the warrantless blood draw, and that the warrantless blood draw was permissible pursuant to the implied consent law. Upon review, we reversed the portion of the trial court's judgment declaring Code section 55-10-406(f)(1) unconstitutional but affirmed the trial court's suppression of the results of the warrantless blood draw because no exception to the warrant requirement existed. State v. Melvin Brown, No. W2014-00162-CCA-R9-CD, 2015 WL 1951870 (Tenn. Crim. App. Apr. 30, 2015), perm. app. granted and remanded, No. W2014-00162-SC-R11-CD (Tenn. Nov. 22, 2016) (order). On November 22, 2016, the Tennessee Supreme Court granted the State's application for permission to appeal and remanded the case to this court for reconsideration in light of the supreme court's opinion in State v. Reynolds, 504 S.W.3d 283 (Tenn. 2016).2 State v. Melvin Brown, No. W2014-00162-SC-R11-CD (Tenn. Nov. 22, 2016) (order). Upon reconsideration, we conclude that the good-faith exception to the exclusionary rule adopted in Reynolds applies to this case and that suppression of the Defendant's test results was not required. Therefore, the trial court's judgment suppressing the test results of the warrantless blood draw is reversed, and the case is remanded to the trial court for further proceedings consistent with this opinion."
    },
    {
        "absolute_url": "/opinion/1327385/state-v-tellez/",
        "caseName": "State v. Tellez",
        "court": "Court of Appeals of North Carolina",
        "dateFiled": "2009-11-03",
        "judge": "Jackson, McGee, Steelman",
        "syllabus": "<bold>1. Appeal and Error — preservation of issues</bold> <bold>— limiting instruction — no objection</bold>\n<block_quote>      An appeal from a limiting instruction was not considered where defendant failed to object to the instruction when given prior to the introduction of the contested evidence, did not object to the instruction at the close of the evidence on the theory now presented, and neither assigned nor argued plain error.</block_quote>\n<bold>2. Homicide — second-degree murder — drunken</bold> <bold>driving — malice — evidence sufficient</bold>\n<block_quote>      The State's evidence of defendant's convictions for reckless driving, alcohol consumption both before and while operating a motor vehicle, prior impaired driving, and driving while license revoked, as well as flight and elusive behavior after the collision, constituted substantial evidence of malice based upon depravity of mind sufficient to withstand a motion to dismiss a second-degree murder prosecution.</block_quote>\n<bold>3. Evidence — hearsay — trooper's account of</bold> <bold>witness's statements — admissible —</bold> <bold>corroboration</bold>\n<block_quote>      In a second-degree murder prosecution arising from an auto collision, a Highway Patrol Trooper's testimony relating a passenger's statements about defendant (the driver) being drunk was properly admitted for corroboration because it strengthened the passenger's testimony. Furthermore, defendant could not demonstrate prejudice.</block_quote>\n<bold>4. Appeal and Error — preservation of issues —</bold> <bold>closing argument — general objection</bold>\n<block_quote>      Defendant's general objection to the State's closing argument in a second-degree murder prosecution did not preserve for<page_number>Page 518</page_number>\nappellate review an issue involving due process or other constitutional considerations.</block_quote>\n"
    },
    {
        "absolute_url": "/opinion/9381151/state-v-mclaughlin/",
        "caseName": "State v. McLaughlin",
        "court": "North Dakota Supreme Court",
        "dateFiled": "2023-03-03",
        "judge": "Per Curiam",
        "syllabus": "A criminal judgment is summarily affirmed under N.D.R.App.P. 35.1(a)(8) and (4)."
    },
    {
        "absolute_url": "/opinion/1805894/state-v-boucher/",
        "caseName": "State v. Boucher",
        "court": "Supreme Court of Minnesota",
        "dateFiled": "1970-04-10",
        "judge": "Knutson, Rogosheske, Sheran, Peterson, Gallagher",
        "syllabus": "<bold>Criminal law — reckless driving through four municipalities —</bold> <bold>prosecution and conviction in one as bar to further</bold> <bold>prosecution</bold>.\n\n<block_quote>    Uninterrupted course of reckless driving through four municipalities held to be a single behavioral incident for which defendant can be prosecuted and punished only once in light of Minn. St. <cross_reference>609.035</cross_reference>.</block_quote>\n"
    },
    {
        "absolute_url": "/opinion/10615330/state-of-tennessee-v-corbin-ramon-hightie/",
        "caseName": "State of Tennessee v. Corbin Ramon Hightie",
        "court": "Court of Criminal Appeals of Tennessee",
        "dateFiled": "2025-06-23",
        "judge": "Robert H. Montgomery, Jr.",
        "syllabus": "The Defendant, Corbin Ramon Hightie, appeals from the Montgomery County Circuit Court's probation revocation of his ten-year sentence. The Defendant contends that the trial court erred by failing to consider alternative sentencing and by denying his request to award sentence credits for time he successfully served on probation. We affirm the judgment of the trial court."
    },
    {
        "absolute_url": "/opinion/1300716/state-v-brewington/",
        "caseName": "State v. Brewington",
        "court": "Court of Appeals of North Carolina",
        "dateFiled": "2005-05-17",
        "judge": "Hunter, McCULLOUGH, Wynn",
        "syllabus": "<bold>1.  Search and Seizure —</bold> <bold><italic>Terry</italic></bold> <bold>stop — motion to suppress —</bold> <bold>probable cause — detention of passenger of car</bold>\n<block_quote>      The trial court did not err in an assault on a governmental officer with a deadly weapon and reckless driving case by denying defendant passenger's motion to suppress evidence of an alleged unlawful stop and detention by a police officer on 10 September 2002, because: (1) the trial court properly concluded that there was probable cause to stop the vehicle when the officer observed that the driver was not wearing a seatbelt in violation of N.C.G.S. § <cross_reference>20-135.2A</cross_reference>(a); (2) although defendant had not been observed violating any laws at the time of the stop, it is not unreasonable under the  <cross_reference>Fourth</cross_reference> Amendment of the United States Constitution to detain a passenger when a vehicle has been stopped due to a traffic violation committed by the driver of the car; (3) once the original purpose of the stop had been addressed, the trial court correctly determined that there was a reasonable articulable suspicion to require defendant to remain at the scene when defendant's behavior, combined with the discovery of narcotics on the driver during a consensual pat-down search, created a reasonable articulable suspicion which permitted the officer to detain defendant passenger to address the deputy's concerns; and (4) the police had probable cause to search the car based upon the discovery of illegal narcotics upon the driver's person, and even assuming the deputy did not have any authority to detain defendant at the scene, he possessed authority to detain the car at the scene.</block_quote>\n<bold>2.  Criminal Law — instruction — right to resist unlawful</bold> <bold>arrest</bold>\n<block_quote>      The trial court did not err in an assault on a governmental officer with a deadly weapon and reckless driving case by denying defendant's request for a jury instruction on the right to resist an unlawful arrest, because: (1) upon discovering illegal narcotics on the driver's person, the police had probable cause to search the stopped vehicle in which defendant was a passenger; and (2) at the moment defendant slid into the driver's seat of the stopped vehicle, tried to start the car, and ignored the officer's command to stop, a violation of N.C.G.S. § <cross_reference>14-223</cross_reference> occurred and defendant was subject to arrest.</block_quote><page_number>Page 265</page_number>\n<bold>3.  Assault — assault on governmental officer with deadly weapon</bold> <bold>— motion to dismiss — sufficiency of evidence</bold>\n<block_quote>      The trial court did not err by denying defendant's motion to dismiss the charge of assault on a governmental officer with a deadly weapon even though defendant contends he was unlawfully seized by the officer and rightfully asserted his right to resist such a seizure, because the officer had authority to arrest defendant when defendant's actions constituted a violation of N.C.G.S. § <cross_reference>14-223</cross_reference>, a class 2 misdemeanor.</block_quote>\n<bold>4.  Criminal Law — instruction — defendant not arrested as a</bold> <bold>matter of law — plain error analysis</bold>\n<block_quote>      The trial court did not commit plain error in an assault on a governmental officer with a deadly weapon and reckless driving case by instructing the jury that defendant had not been arrested as a matter of law, because: (1) an arrest requires either physical force or, where that is absent, submission to the assertion of authority; and (2) neither occurred in this case.</block_quote>\n<bold>5.  Criminal Law — instruction — self-defense — failure to</bold> <bold>instruct on lawfulness of arrest or defendant's right to</bold> <bold>resist arrest</bold>\n<block_quote>      The trial court did not err by instructing the jury on the law of self-defense without instructing on the lawfulness of defendant's arrest and his right to resist it, because: (1) defendant was not arrested as he did not submit to the officer's show of authority and any physical force applied did not restrain defendant's liberty; (2) as the officer was being dragged by the car defendant was driving, the officer hit defendant with the butt of his gun in his attempt to free himself; and (3) defendant was not resisting an unlawful arrest as his attempt to remove the driver's vehicle from the scene was a violation of N.C.G.S. § <cross_reference>14-223</cross_reference>.</block_quote>\n<bold>6.  Criminal Law — instructions — no expression of opinion by</bold> <bold>trial court</bold>\n<block_quote>      The trial court in a prosecution for assaulting a governmental officer with a deadly weapon did not impermissibly explain the application of the law to the jury or express an opinion on the evidence in violation of N.C.G.S. § <cross_reference>15A-1232</cross_reference> by instructing the jury that the law was violated if a driver was not wearing a seatbelt while driving on a public street, that a deputy would have a right to detain the car for a search if he found cocaine on the driver, and that defendant contended that he acted in self-defense.</block_quote><page_number>Page 266</page_number>\n<bold>7.  Evidence — prior crimes or bad acts — warrant for arrest</bold> <bold>from another state for probation violation</bold>\n<block_quote>      The trial court did not err in an assault on a governmental officer with a deadly weapon and reckless driving case by admitting evidence of a warrant for defendant's arrest from the State of Virginia for a probation violation, because: (1) the outstanding warrant was admissible under N.C.G.S. § <cross_reference>8C-1</cross_reference>, Rule 404(b) since it provided a possible explanation or motive for defendant's actions on 10 September 2001; and (2) although defendant contends the trial court did not instruct the jury that the evidence was admitted for a limited purpose only, defendant did not request a limiting instruction.</block_quote>\n<bold>8.  Evidence — prior crimes or bad acts — traffic stop for</bold> <bold>possession of drug paraphernalia</bold>\n<block_quote>      The trial court did not err in an assault on a governmental officer with a deadly weapon and reckless driving case by allowing an Ohio police officer to testify regarding a traffic stop that occurred about one month after the incident in this case, during which defendant was arrested for the possession of drug paraphernalia, because: (1) the officer's testimony that a substance found during the stop was similar to cocaine was properly allowed even though the officer was not qualified as an expert because the officer did not testify that the substance was definitely cocaine, and the officer clarified that he was expressing an opinion satisfactory to himself based upon his training and experience in law enforcement; (2) evidence of the circumstances surrounding the stop was admissible under N.C.G.S. § <cross_reference>8C-1</cross_reference>, Rule 404(b) since it was evidence of defendant's modus operandi, i.e., he fled a crime scene in another person's car since he was involved in a drug offense, defendant's actions were substantially similar in both cases, and the evidence showed defendant's motive or intentions in this case to flee the scene in order to avoid arrest on outstanding warrants or to prevent the discovery of drugs or drug paraphernalia in the car or on his person; (3) even assuming the admission of the circumstances regarding defendant's arrest in Ohio was erroneous, the evidence that defendant was arrested on the outstanding warrant in Ohio and extradited to North Carolina was relevant and admissible; and (4) the admission of defendant's actions during the Ohio traffic stop was nonprejudicial error as the State presented evidence that defendant assaulted a New Hanover deputy by dragging the officer with his car.</block_quote><page_number>Page 267</page_number>\n<bold>9.  Sentencing — habitual felon — evidentiary hearing without</bold> <bold>motion from either party — not an advisory opinion</bold>\n<block_quote>      The trial court did not issue an impermissible advisory opinion or commit plain error by conducting an evidentiary hearing prior to the beginning of the habitual felon phase when no motion for such a hearing had been properly made before the court, because: (1) the trial court has the inherent authority to conduct an evidentiary hearing outside the presence of a jury sua sponte to clarify questions of admissibility and to prevent undue delay in the proceedings; and (2) by conducting the hearing out of the presence of the jury and prior to the presentation of evidence during the habitual felon phase, the trial court was able to resolve any arguments and concerns regarding the evidence and the habitual felon proceedings before the jury proceeded without any delay.</block_quote>\n<bold>10. Sentencing — habitual felon — felonious possession of</bold> <bold>cocaine</bold>\n<block_quote>      The trial court did not commit plain error by allowing a felonious possession of cocaine charge to be a predicate felony for the habitual felon indictment, because the possession of cocaine under N.C.G.S. § <cross_reference>90-95</cross_reference>(d)(2) is a felony and a proper basis for an habitual felon indictment.</block_quote>\n<bold>11. Sentencing — habitual felon indictment — sufficiency of</bold> <bold>evidence — facsimile copy of prior conviction</bold>\n<block_quote>      The trial court did not err by failing to dismiss the habitual felon indictment even though defendant contends the State allegedly failed to produce sufficient evidence of the third felony listed in the habitual felon indictment when the State submitted a facsimile of the prior crime indicating that defendant was found guilty of unarmed robbery in a federal court in Ohio, because: (1) a faxed, certified copy of a court record is a reliable source of a defendant's prior conviction for habitual felon purposes; (2) regardless of the fact that the possibility of receiving an unconditional discharge and having the underlying conviction set aside was part of the sentence imposed upon defendant for his felonious unarmed bank robbery conviction, defendant was convicted of a felony for habitual felon purposes; and (3) although defendant makes an argument that he may have received an unconditional discharge under 19 U.S.C.A. § 5021, thus meaning his unarmed robbery conviction was set aside, he did not present<page_number>Page 268</page_number>\nany evidence proving with any certainty that the conviction has been set aside.</block_quote>\n"
    },
    {
        "absolute_url": "/opinion/4494086/state-v-hines/",
        "caseName": "State v. Hines",
        "court": "Court of Appeals of North Carolina",
        "dateFiled": "2018-05-01",
        "judge": "Bryant",
        "syllabus": "Corpus Delicti Rule DWI Motion to Dismiss"
    },
    {
        "absolute_url": "/opinion/10596556/state-v-yemsvat/",
        "caseName": "State v. Yemsvat",
        "court": "Ohio Court of Appeals",
        "dateFiled": "2025-06-02",
        "judge": "Willamowski",
        "syllabus": "Misdemeanor Sentencing; R.C. 2929.21; R.C. 2929.22(B) Factors. R.C. 2929.21(A) lists the overriding purposes of misdemeanor sentencing. Appellate courts review misdemeanor sentences under an abuse of discretion standard. A trial court is not required to state its reasons for imposing a misdemeanor sentence."
    },
    {
        "absolute_url": "/opinion/10027648/state-v-reiswig/",
        "caseName": "State v. Reiswig",
        "court": "North Dakota Supreme Court",
        "dateFiled": "2024-08-01",
        "judge": "Jensen, Jon J.",
        "syllabus": "This Court employs a trustworthiness approach when analyzing whether a confession is sufficiently corroborated. Under this approach, not every statement made in a confession must be independently verified instead, we look to a statement made in its entirety and the facts and circumstances in which it was made to determine if it is reliable and trustworthy. A person of reasonable caution could conclude the statement \"we did have sex\" means sexual intercourse meeting the statutory definition of a sexual act under N.D.C.C. § 12.1-20-02(4)."
    },
    {
        "absolute_url": "/opinion/1203028/state-v-stokes/",
        "caseName": "State v. Stokes",
        "court": "Court of Appeals of North Carolina",
        "dateFiled": "2005-11-15",
        "judge": "Tyson, Jackson, John",
        "syllabus": "<bold>1.  Motor Vehicles — felonious fleeing to elude arrest —</bold> <bold>sufficiency of indictment</bold>\n<block_quote>      The indictment was sufficient to charge defendant with felonious fleeing to elude arrest because: (1) the language of the indictment tracks N.C.G.S. § <cross_reference>20-141.5</cross_reference>, and alleges all of the elements defined by the statute and the elements necessary to elevate the offense from a misdemeanor to a felony; and (2) the United States Supreme Court has consistently declined to impose a requirement mandating states to prosecute only upon indictments which include all elements of an offense.</block_quote>\n<bold>2.  Motor Vehicles — felonious fleeing to elude arrest — jury</bold> <bold>instructions — gross impairment</bold>\n<block_quote>      The trial court did not commit plain error in a felonious fleeing to elude arrest case by failing to define the legal requirements for the necessary element of \"gross impairment\" in the jury instructions, because: (1) the language used in the statute and jury instructions accords with the ordinary meaning of the term \"grossly impairment\" and is understandable; and (2) the legislature did not intend for the words \"gross impaired\" to mean anything other than their common and ordinary meaning.</block_quote>\n<bold>3.  Motor Vehicles — felonious fleeing to elude arrest — theory</bold> <bold>of guilt</bold>\n<block_quote>      The trial court in a prosecution for felonious fleeing to elude arrest did not improperly instruct the jury on a theory of guilt different from that set forth in the indictment, because: (1) although the State alleged three aggravating factors in the indictment to support the charge, the plain language of the statute only requires proof of two or more of the factors to support a felony conviction; and (2) the State's evidence supported the charges of defendant's reckless driving and gross impairment of defendant's faculties set forth in the indictment.</block_quote>\n<bold>4.  Motor Vehicles — felonious fleeing to elude arrest — motion</bold> <bold>to dismiss — sufficiency of evidence</bold>\n<block_quote>      The trial court did not err in a felonious fleeing to elude arrest case by denying defendant's motions to dismiss at the close<page_number>Page 448</page_number>\nof the State's evidence and at the close of all evidence based on alleged insufficient evidence of speeding and gross impairment, because: (1) the lack of evidence or the State's abandonment of speeding in excess of fifteen miles per hour over the legal speed limit as an aggravating factor did not constitute error when the State was only required to prove two of the three factors listed in the indictment to elevate the crime from a misdemeanor to a felony; and (2) sufficient evidence was presented to support a conclusion by the jury that defendant was grossly impaired including that defendant had a strong odor of alcohol about him; defendant's eyes were very red, glazed, and glassy; defendant's speech was hard to understand; defendant repeatedly used profanity against the officers; defendant told an officer that he was going to die; defendant drove one-half mile with the lower portion of an officer's body hanging out of the window of defendant's vehicle; defendant had to be forcibly removed from his vehicle; and defendant testified he consumed six to seven beers at a local bar between 9:30 pm and 1:00 am, and admitted he was under the influence of alcohol when he pulled off from the traffic stop.</block_quote>\n<bold>5.  Criminal Law — jury instruction — officer's duty — not</bold> <bold>improper comment on evidence</bold>\n<block_quote>      The trial court did not improperly comment on the evidence during its instructions on assault with a deadly weapon on a government officer by its statement that \"arresting a person for driving while impaired is a duty of a Greensboro police officer\" when there was no evidence that defendant was arrested or charged with driving while impaired where the officer was investigating a possible driving while impaired offense at the time of the alleged assault, and the court's instruction related to whether the officer was performing a duty of his office at the time of the assault.</block_quote>\n"
    },
    {
        "absolute_url": "/opinion/10131106/state-v-reiswig/",
        "caseName": "State v. Reiswig",
        "court": "North Dakota Supreme Court",
        "dateFiled": "2024-08-01",
        "judge": "Jensen, Jon J.",
        "syllabus": "This Court employs a trustworthiness approach when analyzing whether a confession is sufficiently corroborated. Under this approach, not every statement made in a confession must be independently verified; instead, we look to a statement made in its entirety and the facts and circumstances in which it was made to determine if it is reliable and trustworthy. A person of reasonable caution could conclude the statement \"we did have sex\" means sexual intercourse meeting the statutory definition of a sexual act under N.D.C.C. § 12.1-20-02(4)."
    },
    {
        "absolute_url": "/opinion/4531011/emiabata-v-united-states/",
        "caseName": "Emiabata v. United States",
        "court": "United States Court of Federal Claims",
        "dateFiled": "2018-08-29",
        "judge": "Patricia E. Campbell-Smith",
        "syllabus": "REPORTED OPINION granting Motion for Summary Judgment. The Clerk is directed to enter judgment. Signed by Judge Patricia E. Campbell-Smith. (hw1) Service on parties made."
    }
]